
## :x: Apply Failed

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/7686673829)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/tfc-mongulu-cm/mtchoun-mouh-lambda-layer/runs/run-b9FCHyA1cEHP1tRp

Waiting for the plan to start...

Terraform v1.5.4
on linux_amd64
Initializing plugins and modules...
null_resource.lambda_layer: Refreshing state... [id=7799415462165625040]
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 1s [id=6b48ecc0b5ee5af0b1a66623d63b72253afdf934]
data.aws_iam_role.role: Reading...
data.aws_caller_identity.current: Reading...
aws_dynamodb_table.Users: Refreshing state... [id=mtchoun-mouh-lambda-layer-Users]
aws_s3_bucket.images: Refreshing state... [id=mtchoun-mouh-lambda-layer-djansang]
aws_api_gateway_rest_api.api: Refreshing state... [id=o1e3qkz6f9]
aws_dynamodb_table.Link_table: Refreshing state... [id=mtchoun-mouh-lambda-layer-Link_table]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=mtchoun-mouh-lambda-layer-trigger_user_scan]
aws_s3_bucket.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
aws_dynamodb_table.Register: Refreshing state... [id=mtchoun-mouh-lambda-layer-Register]
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]
aws_lambda_function.lambda: Refreshing state... [id=mtchoun-mouh-lambda-layer-user_registration_consulcam]
aws_lambda_function.scan: Refreshing state... [id=mtchoun-mouh-lambda-layer-scan_user_consulcam]
aws_api_gateway_resource.resource: Refreshing state... [id=rwxfg3]
aws_api_gateway_method.method: Refreshing state... [id=agm-o1e3qkz6f9-rwxfg3-POST]
module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-o1e3qkz6f9-rwxfg3-OPTIONS]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.target: Refreshing state... [id=mtchoun-mouh-lambda-layer-trigger_user_scan-lambda]
aws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-o1e3qkz6f9-rwxfg3-POST-200]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-o1e3qkz6f9-rwxfg3-POST]
module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-o1e3qkz6f9-rwxfg3-OPTIONS-200]
module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-o1e3qkz6f9-rwxfg3-OPTIONS]
aws_api_gateway_deployment.test: Refreshing state... [id=suutve]
module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-o1e3qkz6f9-rwxfg3-OPTIONS-200]
local_file.index_page: Refreshing state... [id=98f455ae6da3a4cb9d87a96da07698b2dfcc0530]
aws_s3_bucket_object.example_file: Refreshing state... [id=index.html]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
aws_s3_bucket_policy.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      ~ last_modified                  = "2023-10-01T10:29:02.000+0000" -> (known after apply)
      ~ layers                         = [] -> (known after apply)
      ~ source_code_hash               = "jHrjiGwuUY06vfQXZpa9VGa7gSuTUy3i+veidKXYOEU=" -> "utvZZJ0gL++TSbp06khXeV+UgRlbbI4ym3qYCB4fNBo="
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.test_lambda_layer will be created
  + resource "aws_lambda_layer_version" "test_lambda_layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.7",
          + "python3.8",
        ]
      + created_date                = (known after apply)
      + filename                    = "python.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "test_lambda_layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "mtchoun-mouh-lambda-layer-djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (12 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

Plan: 2 to add, 3 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.74096/mo +$0.0

------------------------------------------------------------------------

aws_lambda_layer_version.test_lambda_layer: Creating...
aws_s3_bucket.images: Modifying... [id=mtchoun-mouh-lambda-layer-djansang]
aws_s3_bucket.website: Modifying... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
local_file.index_page: Creating...
local_file.index_page: Creation complete after 0s [id=98f455ae6da3a4cb9d87a96da07698b2dfcc0530]
aws_s3_bucket.images: Modifications complete after 6s [id=mtchoun-mouh-lambda-layer-djansang]
aws_s3_bucket.website: Modifications complete after 6s [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
╷
│ Error: Unable to load "python.zip": open python.zip: no such file or directory
│ 
│   with aws_lambda_layer_version.test_lambda_layer,
│   on main.tf line 188, in resource "aws_lambda_layer_version" "test_lambda_layer":
│  188: resource "aws_lambda_layer_version" "test_lambda_layer" {
│ 
╵
Operation failed: failed running terraform apply (exit 1)

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":144,"Program":"tfcmt","SHA1":"886a078455250acb421da7c6344f79b8eb57d061","Vars":{},"WorkflowName":"Deploy cases"} -->